
def area(a):
    '''
    Возращает площадь квадрата на основе его стороны a.

        Параметры:
            a (float): сторона квадрата.

        Возращаемое значение:
            float: площадь квадрата, вычисляемая по формуле -> a * a
    '''
    return a * a


def perimeter(a):
    '''
    Возращает периметр квадрата на основе его стороны a.

        Параметры:
            a (float): сторона квадрата.

        Возращаемое значение:
            float: периметр квадрата, вычисляемый по формуле -> 4 * a
    '''
    return 4 * a
